Tekla.Structures.DialogInternal.CDelegate.Singletons
Storage class for singleton instances.

Tekla.Structures.DialogInternal.CDelegate.Singletons.#cctor
Explicit static constructor to tell C# compiler
not to mark type as beforefieldinit. Do not remove.